# frozen_string_literal: true

# Dual Panel File Browser
cask 'marta'

# Fast GPU rendered terminal emulator
cask 'wezterm'

# best screenshot tool on mac
cask 'cleanshot'

# setup a hyper key modifier
cask 'hyperkey'

# note taking app and Zettlekasten
# cask 'obsidian'

# spotlight alternative
cask 'raycast'

# a terminal emulator (used primarily for wrapping terminal apps)
cask 'iterm2'

# allow accessing passwords from a CLI
cask '1password-cli'

# macOS automation using Lua
cask 'hammerspoon'

# run open source LLM models locally
cask 'ollama-app'

# for Erlang
# brew 'wxwidgets'
# brew 'autoconf'
# brew 'fop'
# brew 'libiodbc'
brew 'openjdk'

# for generating graphics
brew 'graphviz'

# code stats
brew 'scc'

# SQLite3
brew 'sqlite'

# image manipulation
brew 'imagemagick'

# easily copy tabular data
brew 'yank'

# format postgres sql files
brew 'pgformatter'

# Postgres pager
brew 'pspg'

# Postgres client
brew 'libpq'

# compile C stuff
brew 'cmake'

# c++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'btop'

# docker desktop for containers
cask 'docker-desktop'

# build tool
brew 'make'

# terminal multiplexer
brew 'tmux'

# vimium like jumps in tmux
tap 'morantron/tmux-fingers'
brew 'morantron/tmux-fingers/tmux-fingers'

# download files from the terminal, used by some scripts
brew 'wget'

# OpenSSL - important for compiling things that support SSL
brew 'openssl'

# linter for bash scripts
brew 'shellcheck'

# keep ZSH up to date
brew 'zsh'

# required by ccls
brew 'llvm'

# the watch command
brew 'watch'

# set default application for opening files on mac
brew 'duti'

# for Nerves
# brew 'xz'
# brew 'pkg-config'
# brew 'squashfs'
# brew 'fwup'

# GNU File, Shell, and Text utilities (also required by Nerves)
# https://www.gnu.org/software/coreutils
brew 'coreutils'

# a more up to date version of curl than what macOS offers
brew 'curl'

# run things in parallel
brew 'parallel'

# pretty text display utils
brew 'figlet'

# Mac App Store CLI
brew 'mas'

###########################################################
###########################################################
#                  Personal Additions                     #
###########################################################
###########################################################

# logseq for notes
cask 'logseq'

# script automation
cask 'script-kit'

# Chat
cask 'discord'
cask 'slack'

# HTTP server
brew "caddy"

# env management
brew "direnv"
brew "mise"

# CLI Utilities
brew "fzf"
brew "bat"
brew "fd"
brew "ripgrep"

# Multimedia processing
brew "ffmpeg"

# Version Control
brew "gh"
brew "libgit2"
brew "git-delta"
brew "difftastic"
brew "git-gui"
brew "jj"

# File parsing tools
brew "fx"
brew "jq"
brew "xsv"
brew "yq"
brew "csvlens"

# Make-like tasks
brew "just"

# Development email server
brew "mailhog"

# MySQL
brew "mysql"
brew "mysql-client"

# Document swiss army knife
brew "pandoc"

# Languages
brew "pipx"
brew "go"
brew "rust"

# Mac's Postgres.app
cask "postgres-unofficial"

# PSQL alternative
brew "pgcli"

# Timezone lib
brew "tz"

# Containers
tap "dokku/repo"
brew "dokku/repo/dokku"

# Stripe CLI
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"

# screen resolution tool
cask "betterdisplay"

# Mac keychain management, gpg key
brew "pinentry-mac"

# These came from a `brew bundle dump`, not sure if they belong here yet
# go "github.com/go-delve/delve/cmd/dlv"
# go "golang.org/x/tools/cmd/godoc"
# go "github.com/pressly/goose/v3/cmd/goose"
# go "golang.org/x/tools/gopls"
# go "github.com/plutov/oq"
# go "github.com/jackc/pg_partialcopy"
# go "github.com/google/pprof"
# go "honnef.co/go/tools/cmd/staticcheck"
# go "github.com/jackc/tern/v2"
